tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4420_tdd.h
#define ADON                          522
#define nDONE                         523
#define GO_nDONE                      524
#define NOT_DONE                      525
#define GODONE                        526
#define GO_DONE                       527
#define DONE                          528
#define GO_NOT_DONE                   529
#define GO                            530
#define CHS                           531
#define CHS0                          532
#define CHS1                          533
#define CHS2                          534
#define CHS3                          535
#define SSPCON2                       536
#define SEN                           537
#define RSEN                          538
#define ADMSK1                        539
#define PEN                           540
#define ADMSK2                        541
#define RCEN                          542
#define ADMSK3                        543
#define ACKEN                         544
#define ADMSK4                        545
#define ADMSK5                        546
#define ACKDT                         547
#define ACKSTAT                       548
#define GCEN                          549
#define SSPCON1                       550
#define SSPM0                         551
#define SSPM                          552
#define SSPM1                         553
#define SSPM2                         554
#define SSPM3                         555
#define CKP                           556
#define SSPEN                         557
#define SSPOV                         558
#define WCOL                          559
#define SSPSTAT                       560
#define BF                            561
#define UA                            562
#define R_NOT_W                       563
#define NOT_W                         564
#define nW                            565
#define RW                            566
#define nWRITE                        567
#define R                             568
#define W                             569
#define NOT_WRITE                     570
#define R_nW                          571
#define R_W                           572
#define START                         573
#define S                             574
#define STOP                          575
#define P                             576
#define A                             577
#define NOT_A                         578
#define nA                            579
#define D_A                           580
#define D_nA                          581
#define D                             582
#define DA                            583
#define D_NOT_A                       584
#define NOT_ADDRESS                   585
#define nADDRESS                      586
#define CKE                           587
#define SMP                           588
#define T2CON                         589
#define T2CKPS0                       590
#define T2CKPS                        591
#define T2CKPS1                       592
#define TMR2ON                        593
#define T2OUTPS0                      594
#define T2OUTPS                       595
#define TOUTPS0                       596
#define T2OUTPS1                      597
#define TOUTPS1                       598
#define T2OUTPS2                      599
#define TOUTPS2                       600
#define T2OUTPS3                      601
#define TOUTPS3                       602
#define PR2                           603
#define WM0                           604
#define WM1                           605
#define WAIT0                         606
#define WAIT1                         607
#define EBDIS                         608
#define T1CON                         609
#define TMR1ON                        610
#define TMR1CS                        611
#define NOT_T1SYNC                    612
#define T1SYNC                        613
#define nT1SYNC                       614
#define T1OSCEN                       615
#define SOSCEN                        616
#define T1CKPS0                       617
#define T1CKPS                        618
#define T1CKPS1                       619
#define T1RUN                         620
#define T1CON_RD16                    621
#define T1RD16                        622
#define RCON                          623
#define BOR                           624
#define NOT_BOR                       625
#define nBOR                          626
#define POR                           627
#define nPOR                          628
#define NOT_POR                       629
#define PD                            630
#define nPD                           631
#define NOT_PD                        632
#define NOT_TO                        633
#define nTO                           634
#define TO                            635
#define nRI                           636
#define NOT_RI                        637
#define RI                            638
#define SBOREN                        639
#define IPEN                          640
#define WDTCON                        641
#define SWDTE                         642
#define SWDTEN                        643
#define HLVDCON                       644
#define HLVDL                         645
#define HLVDL0                        646
#define LVV0                          647
#define LVDL0                         648
#define HLVDL1                        649
#define LVDL1                         650
#define LVV1                          651
#define HLVDL2                        652
#define LVV2                          653
#define LVDL2                         654
#define HLVDL3                        655
#define LVV3                          656
#define LVDL3                         657
#define HLVDEN                        658
#define LVDEN                         659
#define BGST                          660
#define IRVST                         661
#define IVRST                         662
#define VDIRMAG                       663
#define OSCCON                        664
#define SCS0                          665
#define SCS                           666
#define SCS1                          667
#define FLTS                          668
#define IOFS                          669
#define OSTS                          670
#define IRCF                          671
#define IRCF0                         672
#define IRCF1                         673
#define IRCF2                         674
#define IDLEN                         675
#define T0CON                         676
#define T0PS                          677
#define T0PS0                         678
#define T0PS1                         679
#define T0PS2                         680
#define PSA                           681
#define T0PS3                         682
#define T0SE                          683
#define T0CS                          684
#define T08BIT                        685
#define T016BIT                       686
#define TMR0ON                        687
#define STATUS                        688
#define C                             689
#define CARRY                         690
#define DC                            691
#define ZERO                          692
#define Z                             693
#define OV                            694
#define OVERFLOW                      695
#define N                             696
#define NEGATIVE                      697
#define INTCON3                       698
#define INT1IF                        699
#define INT1F                         700
#define INT2IF                        701
#define INT2F                         702
#define INT1E                         703
#define INT1IE                        704
#define INT2IE                        705
#define INT2E                         706
#define INT1P                         707
#define INT1IP                        708
#define INT2IP                        709
#define INT2P                         710
#define INTCON2                       711
#define RBIP                          712
#define TMR0IP                        713
#define INTEDG2                       714
#define INTEDG1                       715
#define INTEDG0                       716
#define RBPU                          717
#define NOT_RBPU                      718
#define nRBPU                         719
#define INTCON                        720
#define RBIF                          721
#define INT0F                         722
#define INT0IF                        723
#define T0IF                          724
#define TMR0IF                        725
#define RBIE                          726
#define INT0E                         727
#define INT0IE                        728
#define T0IE                          729
#define TMR0IE                        730
#define PEIE                          731
#define PEIE_GIEL                     732
#define GIEL                          733
#define GIE_GIEH                      734
#define GIE                           735
#define GIEH                          736
#define SP0                           737
#define STKPTR                        738
#define SP1                           739
#define SP2                           740
#define SP3                           741
#define SP4                           742
#define STKUNF                        743
#define STKOVF                        744
#define STKFUL                        745

#endif // _PIC18LF4420_H_
